'''
철로 양끝에 서로 마주보고 있는 두 대의 기차 A 와 B 가 있고,
기차 A 의 기관차 앞에는 파리 한 마리가 붙어 있다.
두 기차 사이의 거리는 d 미터이다.

두 기차 A 와 B 가 서로를 향해 달릴 때, 
파리는 기차 A 에서 기차 B 까지 날아가다가 기차 B 와 부딪히기 직전
방향을 바꿔 기차 A 에게 날아가고 다시 기차 A 와 부딪히기 직전 
기차 B를 향해 날아가기를 기차 A 와 B 가 부딪힐 때까지 반복한다.
기차 A 의 속력은 a m/s, 기차 B의 속력은 b m/s, 파리의 속력은 c m/s 이다.
단, c 가 a, b 보다 커서 파리가 기차보다 빨리 달리며,
두 기차 사이의 거리 d 가 c 보다 크다.
즉, 다음이 성립한다. 

```
a, b < c < d
```

네 개의 자연수 a, b, c, d 가 주어졌을 때, 두 기차가 충돌하기 직전까지 파리가 날아다닌 거리(m)를 
계산하여 반환하는 `fly()`  함수를 구현하라.
단, `while` 반복문을 사용해야 한다.
'''

'''
A의 속력은 a
B의 속력은 b
파리의 속력은 c
두 기차 사이의 거리는 d
파리는 기차 A에서 출발
'''

# pass 와 None 을 각각 적절한 명령문과 반환값으로 대체하라.
def fly(a, b, c, d):
    assert a < c < d
    assert b < c
    time = 0
    while True:
        d = d - (a + b)
        time = time + 1
        if d <=0:
            break
    return time * c  

assert fly(3, 5, 8, 16) == 16
assert fly( 5, 8, 11, 39) == 33